package cardinfo

var (
	DoorInfo map[string]string
	CardStatus map[string]string
)

func init() {

	DoorInfo = map[string]string{
		"1": "进门",
		"2": "进门",
		"3": "出门",
		"4": "出门",
	}

	CardStatus = map[string]string{
		"1": "合法开门",
		"2": "密码开门",
		"3": "卡加密码开门",
		"4": "手动输入卡加密码开门",
		"5": "首卡开门",
		"6": "门常开",
		"7": "多卡开门",
		"8": "重复读卡",
		"9": "有效期过期",
		"10": "不在开门时间段",
		"11": "节假日无效",
		"12": "非法卡",
		"13": "巡更卡不开门",
		"14": "探测锁定",
		"15": "无有效次数",
		"16": "防潜回",
		"17": "密码错误",
		"18": "密码加卡模式密码错误",
		"19": "锁定时或开门",
		"20": "锁定时",
		"21": "首卡未开门",
		"22": "挂失卡",
		"23": "黑名单卡",
		"24": "门内上限已满，禁止入门",
		"25": "开启防盗布防状态",
		"26": "撤销防盗布防状态",
		"27": "开启防盗布防状态",
		"28": "撤销防盗布防状态",
		"29": "互锁时或开门",
		"30": "互锁时",
		"31": "全卡开门",
	}

}