package cardinfo

var (
	DoorInfo map[string]string
	CardStatus map[string]string
)

func init() {

	DoorInfo = map[string]string{
		"01": "进门",
		"02": "进门",
		"03": "出门",
		"04": "出门",
	}

	CardStatus = map[string]string{
		"01": "合法开门",
		"02": "密码开门",
		"03": "卡加密码开门",
		"04": "手动输入卡加密码开门",
		"05": "首卡开门",
		"06": "门常开",
		"07": "多卡开门",
		"08": "重复读卡",
		"09": "有效期过期",
		"0a": "不在开门时间段",
		"0b": "节假日无效",
		"0c": "非法卡",
		"0d": "巡更卡不开门",
		"0e": "探测锁定",
		"0f": "无有效次数",
		"10": "防潜回",
		"11": "密码错误",
		"12": "密码加卡模式密码错误",
		"13": "锁定时或开门",
		"14": "锁定时",
		"15": "首卡未开门",
		"16": "挂失卡",
		"17": "黑名单卡",
		"18": "门内上限已满，禁止入门",
		"19": "开启防盗布防状态",
		"1a": "撤销防盗布防状态",
		"1b": "开启防盗布防状态",
		"1c": "撤销防盗布防状态",
		"1d": "互锁时或开门",
		"1e": "互锁时",
		"1f": "全卡开门",
	}

}